{"keras_version": "2.2.4-tf", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_10", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation"}, "inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "activation"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d", "pool_size": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling2d"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_2"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_4", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_3"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add"}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "name": "add"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "dtype": "float32"}, "inbound_nodes": [[["add", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_6", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_4"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_7", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_5"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_5", "kernel_regularizer": null, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_1"}, "inbound_nodes": [[["activation_5", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "name": "add_1"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "up_sampling2d"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "up_sampling2d"}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "dtype": "float32", "name": "concatenate"}, "inbound_nodes": [[["up_sampling2d", 0, 0, {}], ["add", 0, 0, {}]]], "name": "concatenate"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_9", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["concatenate", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_6"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_10", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_7"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_8", "kernel_regularizer": null, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["concatenate", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_2"}, "inbound_nodes": [[["activation_7", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "name": "add_2"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "up_sampling2d_1"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"class_name": "Concatenate", "config": {"axis": 3, "trainable": true, "dtype": "float32", "name": "concatenate_1"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_1", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_12", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_8"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_13", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "dtype": "float32", "name": "activation_9"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_11", "kernel_regularizer": null, "bias_constraint": null, "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 16, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "Add", "config": {"trainable": true, "dtype": "float32", "name": "add_3"}, "inbound_nodes": [[["activation_9", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_14", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "activation": "linear", "padding": "valid", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 3, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "dtype": "float32", "name": "activation_10"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "activation_10"}], "name": "model"}, "class_name": "Model", "backend": "tensorflow"}